test/setup_pressureVelocityCoupling_mpi2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          36;
        startFace       54;
    }
    inlet
    {
        type            patch;
        nFaces          9;
        startFace       90;
    }
    outlet
    {
        type            patch;
        nFaces          9;
        startFace       99;
    }
)

// ************************************************************************* //
