test/setup_pressureVelocityCoupling_mpi2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "simulationParameters"

ddtSchemes
{
    default         none;
    ddt(U)          Euler;
    ddt(rho,U)      Euler;
    ddt(rho,T)      Euler;
}

gradSchemes
{
    default         none;
    grad(p)         $GRADSCHEME;
    grad(T)         $GRADSCHEME;
    grad(U)         $GRADSCHEME;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,U)      $DIVSCHEME;
}

laplacianSchemes
{
    default           none;
    laplacian(nu,U)   $LAPSCHEME;
    laplacian(rAUf,p) $LAPSCHEME;
}

interpolationSchemes
{
    default         none;
    flux(U)         linear;
    flux(HbyA)      linear;
    // default      linear;
}

snGradSchemes
{
    default         uncorrected;
    // default         corrected;
}

fluxRequired
{
    p;
}


// ************************************************************************* //
